// eslint-disable-next-line import-access/jsdoc
import { EXAMPLE_USER, EXAMPLE_USER_1 } from "src/api/handler/user/data";

import type { ListNoteType, NoteSchema } from "./type";

/**
 * @package
 */
export const EXAMPLE_NOTE_DB: NoteSchema[] = [
  {
    id: "a9gVKV12YV1o0wyknm74x",
    content:
      "ウェブサイト（英: website）は、World Wide Web (WWW) 上にあり、一般に特定のドメイン名の下にある複数のウェブページの集まりのこと。サイトと呼ばれることもある。企業などの団体が自身を紹介するため自ら構築したサイトを、その団体の公式サイトなどと呼ぶ。\n\nホームページと呼ばれることもあるが、この用法は誤用とされる場合もある。また、ウェブサイトのトップページのみをさしてホームページと呼ぶ場合もある。\n\n1990年代のWWWは実験運用の時代にあった。この時代には、WWW提案よりも前の集中型の思想を参考にして、組織の総合的な情報を掲載した、静的コンテンツによるウェブサイトを立ち上げ、手動で管理されるポータルサイトに登録を依頼する例が多かった。しかし、2000年代からロボット型検索エンジンによるウェブサイトの自動登録に移行し、 組織が複数のドメインを取得してサービス別にサイトを切り分けるなど、WWWの本来の思想である分散型のシステムに移行して行った。\n\nイギリスのネットクラフト社（英語版）の調査によると、1995年8月にはインターネット上のサイト数は約1万8000件だった。2006年11月2日の時点でサイト数は1億件を突破した[1]。また、インターネット統計サイトのインターネット・ライブ・スタッツのリアルタイム統計では、2014年9月16日に世界のサイト数が10億件を突破した。WWWの考察者とされるティム・バーナーズリーは、ミニブログのツイッターでこの様子を喜んでいる[2]。",
    excerpt:
      "ウェブサイト（英: website）は、World Wide Web (WWW) 上にあり、一般に特定のドメイン名の下にある複数のウェブページの集まりのこと。サイトと呼ばれることもある。企業などの団体が自身を紹介するため自ら構築したサイトを、その団体の公式サイトなどと呼ぶ。\n\nホ",
    isPublic: true,
    updatedAt: "2021-07-31T14:10:30.538Z",
    isMine: true,
    users: EXAMPLE_USER,
  },
  {
    id: "9_0SrJE92WGz_fkd-tXGq",
    content:
      "広義には、社会的ネットワークの構築の出来るサービスやウェブサイトであれば、ソーシャル・ネットワーキング・サービス（以下、SNS）またはソーシャル・ネットワーキング・サイトと定義される。この為、電子掲示板も広義的にはSNSに含まれることがある。\n\n狭義には、SNSとは人と人とのつながりを促進・サポートする、「コミュニティ型の会員制のサービス」と定義される。あるいはそういったサービスを提供するウェブサイトも含まれる。\n\nSNSの主目的は、個人間のコミュニケーションにある。利用者はサービスに会員登録をすることで利用できるが密接な人の繋がりを重視して、既存の参加者からの招待がないと参加できないシステムになっているものも存在する。\n\n近年では、各国の企業や政府機関など多々な分野においてSNSの利用が進んでいる。首相官邸においてもFacebook、LINEなどのSNSを利用した情報発信を行っている。 また、社内でのコミュニケーションの活性化、情報の地域間格差の解消、SOX法対策のために、多くの企業が社内SNSを導入している。[1]\n\nTwitterに関しては、緩い「繋がり」（人間関係）[2]が発生し、広い意味ではSNSの1つといわれるが、Twitter社自身は、「社会的な要素を備えたコミュニケーションネットワーク」（通信網）であると規定し、SNSではないとしている。[3][4]\n\n多くのサービスは広告収入で収益を上げるビジネスモデルである。したがって、登録情報や様々にサービス側に蓄えられた履歴情報などをもとにターゲティング広告が、インフィード広告などでユーザーに露出する。\n\nFacebook、Twitterは13歳以上の使用を可能とし、13歳未満のアカウントを全てロックするなどの設定を追加するようになった。",
    excerpt:
      "広義には、社会的ネットワークの構築の出来るサービスやウェブサイトであれば、ソーシャル・ネットワーキング・サービス（以下、SNS）またはソーシャル・ネットワーキング・サイトと定義される。この為、電子掲示板も広義的にはSNSに含まれることがある。\n\n狭義には、SNSとは人と人とのつな",
    isPublic: false,
    updatedAt: "2021-07-31T06:37:03.004Z",
    isMine: false,
    users: EXAMPLE_USER_1,
  },
  {
    id: "i4j6fPibsWrI2jBt6YFNF",
    content:
      "ドローン宅配便（ドローンたくはいびん）とは、小型の無人飛行機（ドローン）を用いた商品宅配サービスのことである。\n\n2013年12月ネット通販最大手のアメリカ企業のアマゾン・ドット・コムがドローンを使った商品の配送を検討していると公表し、注目を集めた[1]。アメリカ国内では、ドローンを商業目的で屋外利用する場合に連邦航空局（FAA）による特別な許可が必要になる[1]。そのため同社は、2015年3月に連邦航空局から試験飛行の許可をもらい、実用化を目指している[1]。\n\nアマゾンに続き、2015年10月26日にはアメリカ小売最大手であるウォルマート・ストアーズが、中国のDJIのドローンを使った商品配送を実施するために連邦航空局に対し屋外での試験飛行許可を申請した、とロイター通信社など複数のアメリカメディアが伝えた[1]。ウォルマート・ストアーズ広報担当者は、ロイター通信社の取材に対して、「アメリカ国民の7割は、全米5,000店舗あるウォルマート店舗から5マイル（約8キロメートル）の圏内に住んでおり、店舗からのドローンによる宅配サービスが実現すれば、需要がある」と話した[1]。ウォルマート社では将来的に商品宅配や物流センターの在庫確認にドローンを活用する構想である[1]。しかし、連邦航空局はドローンでの宅配事業に慎重との見方もあり、実際のサービス開始に向けては、同局と申請企業との間の調整が続くと見られている[1]。さらに同年11月には、IT大手であるグーグルも、2017年には宅配サービスを実現させる目標を示し、「空からの宅配」サービスをめぐり、一段と競争がはげしくなった[2]。2015年11月29日には、アマゾンが開発中の配送用のドローンの映像を公開した[3]。上空の障害物を避けながら飛行でき、飛び続けられる距離は25キロメートルという[3]。高度は最高約120メートルで、約2キログラムまでの商品を30分以内で届けられるという[3]。映像では、ドローンが民家の庭に置かれた着陸用の目印の上に降りる様子も写っていた[3]。アメリカ連邦航空局は、この時点ではドローンの商業利用についての規制をまだ固めていない[3]。アマゾンはこの映像公開に先立つことの同年7月、飛行機などとの衝突を避けるため、空を高度ごとに区分して宅配用の「高速ドローン専用空域」を設定することを提案していた[3]。同社によると、2016年時点ではアメリカ、イギリス、イスラエルでの宅配事業の実証実験が行われているが、同社による日本での実証実験は未定だった[4]。2016年に中国の京東集団は農村部での世界初の商用ドローン配送サービスを開始し[5][6]、2017年8月にはアイスランドの企業アハとイスラエル企業フライトレックスが中国のDJIのドローンを用いて都市部での世界初の商用ドローン配送サービスを開始した[7][8]。世界初の全国規模でのドローン配送サービスはルワンダでアメリカ企業ジップライン・インターナショナル（英語版）が2016年に開始した[9]。\n\n国連の専門機関である「国際電気通信連合（ITU）」が「世界無線通信会議」を原則3から4年に1回開いているが、スイス・ジュネーブで開催された会議において、民間で大型無線航空機（ドローン）を人工衛星経由で操縦するための周波数の割り当てが決まったと2015年11月28日付け朝日新聞夕刊が報じた[10]。それまで、人工衛星経由で操縦されるドローンは、各国の軍隊が独自運用する軍用ドローンにほぼ限定されていた[10]。民間に周波数の割り当てが決まったことで、将来、長距離を飛ぶ大型ドローンの商用利用が一気に進む可能性が出てきた[10]。\n\n千葉市は、2015年10月30日に、「国家戦略特区等における新たな措置に係る提案募集」（内閣府）に対し、幕張新都心地区におけるドローンを使った宅配サービス事業の提案を行った[11]。政府レベルでは、同年11月5日、「未来に向けた官民対話」の第2回会合が総理大臣、主要閣僚と経済3団体のトップや豊田章男・トヨタ自動車会長、ポール・マイズナー・米アマゾン・ドット・コム副社長らが出席して開かれた[12]。この中で安倍首相は「自動走行、ドローン、健康医療は、安全性と利便性を両立できる有望分野だ」と述べ、その場で環境整備の具体策を述べたという[12]。規制緩和を加速させ、企業の研究開発などへの投資を増やし、経済成長につなげるねらいである[12]。ドローンを使った荷物の宅配は、航空法を改正するなどして、実現につなげる考えである[12]。官民の協議会を立上げ、2016年夏までにルールを整える方針である[12]。同年12月15日、政府の国家戦略特区諮問会議において国家戦略特区に千葉市を指定し、ドローンを使った宅配ができるようにすると発表した[13]。千葉市の計画によると、幕張新都心地区のマンションの周辺にドローンの発着場を設け、約10キロメートル離れた物流倉庫から、ドローンで海や川の上を通って荷物を運ぶ[13]。米アマゾンが参入する方針であり、この地域にある物流倉庫を活用する[13]。ドローンを使うことで、配達の時間を短くしたり、人件費を減らしたりできる[13]。また同地区のドラッグストアからマンションの各戸のベランダなどに、ドローンで薬や日用品を届ける計画もある[13]。合わせてテレビ電話で服薬指導を受けて処方薬を買えるように規制を緩め、外に買い物に出にくい高齢者や子育て世代などの利便性を高める[13]。後述改正航空法では、ドローンは高さ150メートル以上や人口集中地では飛行が禁止され、目視による監視も常時求められるが、こうした規制も緩和する[13]。ドローンによる宅配を目指すアマゾンは、米国など複数の国でテスト飛行しているが、事業化には至っていない[13]。アマゾンは2018年までの事業化を目指す[13]。実現すれば世界初となる[13]。熊谷俊人市長が、日本経済新聞の取材に対して明らかにしたところによれば、千葉市は2016年4月から、ドローンによる宅配実現に向けて、官民共同でのプロジェクトチームを立ち上げることになった[14]。プロジェクトチームには楽天やヤマト運輸などドローン宅配便の事業化を検討している企業が参加し、千葉大学発ベンチャーの自立制御システム研究所（千葉市）と組んで、荷物を抱えたドローンが強風の吹く海上でも安定的に飛行できるかどうかなどについて調べる[14]。\n\n千葉市と、楽天をはじめとする物流や通信などの大手企業約10社、さらにドローンの開発・製造を手掛ける「自律制御システム研究所」（千葉市）による官民共同の検討会が、2016年4月11日、プロペラの6つ付いたドローン（バッテリーを除く重さ3キログラム）を使って個人の家に宅配をする実証実験が千葉市美浜区の幕張新都心で行った[4][15]。2019年の実用化を目指すという[4]。",
    excerpt:
      "ドローン宅配便（ドローンたくはいびん）とは、小型の無人飛行機（ドローン）を用いた商品宅配サービスのことである。\n\n2013年12月ネット通販最大手のアメリカ企業のアマゾン・ドット・コムがドローンを使った商品の配送を検討していると公表し、注目を集めた[1]。アメリカ国内では、ドロー",
    isPublic: true,
    updatedAt: "2021-07-31T02:34:04.460Z",
    isMine: false,
    users: EXAMPLE_USER_1,
  },
  {
    id: "glpgllyWmC08B6240RTLI",
    content:
      "コンピュータープログラミングとは\n\n（英語: Computer Programming）とは、ある特定のコンピューティングの結果を得ることを目的として、実行可能なコンピュータープログラムを設計・構築するプロセスのことである。プログラミングが関係するタスクの例としては、アルゴリズムの生成、アルゴリズムの正確さとリソースの消費量のプロファイリング、選択したプログラミング言語でのアルゴリズムの実装（これは一般にコーディングと呼ばれる）などがある[1][2]。プログラムのソースコードは、コンピューターのCPUで直接実行される機械語ではなく、プログラマーが理解できる1つ以上のプログラミング言語で書かれる。プログラミングの目的は、あるタスク（オペレーティングシステムのように複雑な場合もある）をコンピューター上で自動化する1連の命令を見つけることで、与えられた問題を解決することである。そのため、プログラミングのプロセスには、アプリケーションドメインに関する知識、特定のアルゴリズム、形式論理など、さまざまな主題に関する専門性が要求されることが多い。\n\nプログラミングをするときに関係するタスクには、テスト、デバッグ、ソースコードのメンテナンス、ビルドシステムの構築、コンピュータープログラムの機械コードなどの生成されたアーティファクト（英語版）の管理などがある。これらのプロセスはプログラミングのプロセスの一部と考えられるが、広義のプロセスはよく「ソフトウェア開発」と呼ばれ、実際にコードを書く行為に対しては、「プログラミング」、「実装」、「コーディング」という名前が使われることが多い。ソフトウェア工学 (software engineering) は、エンジニアリングの技術をソフトウェア開発の実践と組み合わせたものである。「リバースエンジニアリング」はこの逆のプロセスを表す。「ハッカー」とは、技術的な知識を使って問題を解決する技術のあるすべてのコンピュータの専門家を表す言葉であるが、一般的な用語では「セキュリティハッカー（英語版）」と同じ意味でも使われている。",
    excerpt:
      "コンピュータープログラミングとは\n\n（英語: Computer Programming）とは、ある特定のコンピューティングの結果を得ることを目的として、実行可能なコンピュータープログラムを設計・構築するプロセスのことである。プログラミングが関係するタスクの例としては、アルゴリズム",
    isPublic: false,
    updatedAt: "2021-07-31T06:09:29.729Z",
    isMine: true,
    users: EXAMPLE_USER,
  },
];

/**
 * @package
 */
export const EXAMPLE_NOTE_LIST: ListNoteType[] = EXAMPLE_NOTE_DB.map((note) => {
  const { content: _, ...rest } = note;
  return rest;
});
